bolknote/MK61S_MINI/code/tools.cpp
#include <Arduino.h>
#include "bounded_string.hpp"
#include "config.h"
#if MK61_USE_ARDUINO_EEPROM_FALLBACK
  #include "EEPROM.h"
#endif
#include "lcd_gui.hpp"
#include "tools.hpp"
#include "development.hpp"
#include "focal.hpp"
#include "file_handlers.hpp"
#include "program_store.hpp"
#include "m61_text.hpp"
#include "shared_scratch.hpp"
#include "settings_journal.hpp"
#include "storage_path.hpp"
#include "runtime_safety.hpp"
#include "mk61emu_core.h"
#include "program_memory_policy.hpp"
#include "keyboard.h"
#include "cross_hal.h"
#include "sound_driver.hpp"
#include "tinybasic.hpp"
#if MK61_ANY_LOADABLE_MODULE
  #include "loadable_module_runtime.hpp"
  #include "virtual_fat.hpp"
#endif
#ifdef SPI_FLASH
  #include <SPI.h>
  #include "spi_nor_flash.hpp"
  #include "manual_lifetime.hpp"
#endif
#include "menu.hpp"
#include "debug.h"
#include "dfu_splash.hpp"
#include "early_dfu.hpp"

#include "ledcontrol.h"
#include <string.h>
using namespace led;

extern void reset_ext_program_state(void);

const  class_LCD_Label  STORE_message(0, 0);
const  class_LCD_Label  STORE_progress_message(0, 1);

static_assert(shared_scratch::SIZE >= program_store::MAX_MK61_TEXT_SIZE, "shared scratch too small for MK61 scripts");

static const SoundNote STARTUP_JINGLE[] = {
  {392, 120, 25, 25},
  {523, 120, 25, 25},
  {587, 120, 25, 25},
  {659, 240, 0, 25},
};

bool ResolveStoredFile(u16 cwd, const char* args,
                       program_store::Entry& entry) {
  return storage_path::resolve_file(cwd, args, entry) ==
         storage_path::Status::OK;
}

bool ResolveStoredFile(const char* args, program_store::Entry& entry) {
  return ResolveStoredFile(program_store::ROOT_ID, args, entry);
}

// Единая точка запуска сохранённого файла: используется терминалом,
// m61-сценариями и проводником. МК61-скрипты уходят в m61_text::open_program,
// который сам решает — вложенный вызов (изнутри сценария) или свежая загрузка.
bool OpenStoredEntry(const program_store::Entry& entry) {
  switch(entry.type) {
    case program_store::ProgramType::MK61:
      return m61_text::open_program(entry.id);
    case program_store::ProgramType::FOCAL:
#if MK61_ENABLE_FOCAL
      return FocalRunSucceeded(RunFocalProgram(entry.id));
#else
      return false;
#endif
    case program_store::ProgramType::TINYBASIC:
#if MK61_ENABLE_TINYBASIC
      return RunTinyBasicProgram(entry.id);
#else
      return false;
#endif
    case program_store::ProgramType::TEXT:
    case program_store::ProgramType::MK61_STATE:
      return program_store_view_entry(entry);
    case program_store::ProgramType::MARKDOWN:
      return file_handlers::open(entry) ==
             loadable_module::FileOpenResult::OK;
    case program_store::ProgramType::FONT:
      return program_store_apply_font(entry);
    case program_store::ProgramType::IMAGE1:
      return file_handlers::open(entry) ==
             loadable_module::FileOpenResult::OK;
    case program_store::ProgramType::APP:
#if MK61_ANY_LOADABLE_MODULE
      {
        u32 result = 0;
        return loadable_module::run_app(entry.id, result) ==
               loadable_module::RuntimeStatus::OK;
      }
#else
      return false;
#endif
    case program_store::ProgramType::CHIP8:
      return file_handlers::open(entry) ==
             loadable_module::FileOpenResult::OK;
  }
  return false;
}

bool OpenStoredFile(const char* args) {
  return OpenStoredFile(program_store::ROOT_ID, args);
}

bool OpenStoredFile(u16 cwd, const char* args) {
  program_store::Entry entry;
  if(!ResolveStoredFile(cwd, args, entry)) return false;
  return OpenStoredEntry(entry);
}

static const SoundNote* sound_sequence = NULL;
static usize sound_sequence_len = 0;
static usize sound_sequence_index = 0;
static usize sound_sequence_pin = PIN_BUZZER;
static t_time_ms sound_sequence_next_at = 0;

static void sound_sequence_cancel(void) {
  sound_sequence = NULL;
  sound_sequence_len = 0;
  sound_sequence_index = 0;
}

static void sound_sequence_start(const SoundNote* sequence, usize len, usize pin) {
  if(sequence == NULL || len == 0) {
    sound_sequence_cancel();
    return;
  }
  sound_sequence = sequence;
  sound_sequence_len = len;
  sound_sequence_index = 0;
  sound_sequence_pin = pin;
  sound_sequence_next_at = millis();
}

static void sound_sequence_poll(void) {
  const t_time_ms now = millis();
  if(sound_sequence == NULL || (i32) (now - sound_sequence_next_at) < 0) {
    return;
  }

  if(sound_sequence_index >= sound_sequence_len) {
    sound_sequence_cancel();
    return;
  }

  const SoundNote note = sound_sequence[sound_sequence_index++];
  const usize volume = library_mk61::sound_volume();
  if(runtime_safety::valid_sound_note(note.frequency_Hz, note.duration_ms, note.volume_percent) &&
     note.frequency_Hz > 0 && volume > 0) {
    sound_driver_play_scaled(sound_sequence_pin, note.frequency_Hz, note.duration_ms, volume, note.volume_percent);
  }
  sound_sequence_next_at = now + (t_time_ms) note.duration_ms + (t_time_ms) note.gap_ms;
}

bool program_needs_expanded_memory(const u8* code_page, usize code_len) {
  return program_memory_policy::listing_needs_expanded_memory(
      code_page, code_len, &core_61::len_code_command);
}

void apply_program_memory_auto(const u8* code_page, usize code_len, bool preserve_program, bool force_expanded) {
  // Ручные 105ШГ и 112ШГ+ПF — жёсткий выбор пользователя.
  if(library_mk61::program_memory_mode() != ProgramMemoryMode::AUTO) return;

  const bool enable_expanded = force_expanded || program_needs_expanded_memory(code_page, code_len);
  if(library_mk61::expanded_program_is_on() == enable_expanded) return;

  u8 saved_code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  if(preserve_program) core_61::get_code_page(&saved_code_page[0]);

  library_mk61::set_program_memory_state(enable_expanded);
  library_mk61::refresh_menu_text();
  library_mk61::store_settings_state();
  reset_ext_program_state();
  core_61::enable();

  if(preserve_program) core_61::set_code_page(&saved_code_page[0]);
}

