bolknote/MK61S_MINI/code/tools.cpp
void ensure_program_memory_for_write(usize linear_addr, u8 opcode) {
  const bool force_expanded =
      linear_addr >= core_61::CLASSIC_PROGRAM_STEP ||
      program_memory_policy::opcode_needs_expanded_memory(opcode);
  if(force_expanded) apply_program_memory_auto(NULL, 0, true, true);
}

static void Show_DFU_splash(void) {
#if defined(MK61_DISPLAY_UC1609)
  static_assert(dfu_splash::WIDTH == lcd_display::PIXEL_WIDTH,
                "DFU bitmap width must match UC1609 panel");
  static_assert(dfu_splash::HEIGHT == lcd_display::PIXEL_HEIGHT,
                "DFU bitmap height must match UC1609 panel");
  if(main_lcd().showFullscreenBitmap(dfu_splash::BITMAP, dfu_splash::BYTE_COUNT)) return;
#endif

  main_lcd().clear();
  library_mk61::print_localized_at(0, 0, "Прошивка DFU", " DFU flash mode!");
}

#if !MK61_EARLY_DFU_SUPPORTED
void DFU_enter_bootloader(void) {
    void (*SysMemBootJump)(void);

    Show_DFU_splash();
    __enable_irq();
    HAL_RCC_DeInit();
    HAL_DeInit();
    SysTick->CTRL = 0; SysTick->LOAD = 0; SysTick->VAL = 0;
    __HAL_SYSCFG_REMAPMEMORY_SYSTEMFLASH();

    const uint32_t p = (*((uint32_t *) 0x1FFF0000));
    __set_MSP( p );

    SysMemBootJump = (void (*)(void)) (*((uint32_t *) 0x1FFF0004));
    SysMemBootJump();

  while(true) {};
}
#endif

void DFU_enable(void) {
  static constexpr u16 USB_HOST_DETACH_MS = 500;

  // Штатный вход из меню может оставить пользователю заставку. После reset
  // ранний F401/F411-пролог уйдёт в ROM до HAL, дисплея и повторного запуска
  // IWDG; контроллер экрана при этом сохраняет уже переданный кадр.
  Show_DFU_splash();
  main_lcd().flush();

  // Сначала фиксируем torn-safe запрос: после фактического USB disconnect
  // любой неожиданный reset всё равно приведёт в ROM DFU. Простого reset сразу
  // из активного CDC недостаточно: host/hub должен однозначно увидеть смену
  // application -> ROM descriptor. USBD_Stop внутри Serial.end() выставляет
  // OTG DCTL.SDIS; 500 мс дают консервативный запас macOS и USB-хабу. Этот
  // интервал не маскирует отдельный F411 ROM/HSE reset: его обрабатывает
  // retained bounded-retry в раннем preinit.
  early_dfu::prepare_request();
#if defined(SERIAL_OUTPUT) && defined(USBCON) && defined(USBD_USE_CDC)
  Serial.flush();
  Serial.end();
  delay(USB_HOST_DETACH_MS);
#endif
  early_dfu::reset_prepared();
}

bool  Confirmation(void) {
  extern void lcd_std_display_redraw(void);

  {
    MK61DisplayUpdate update(main_lcd());
    library_mk61::print_localized_at(0, 0, "OK подтверд", "press OK confirm");
  }
  i32 key = kbd::get_key_wait();
  lcd_std_display_redraw();

  return (key == KEY_OK);
}

void sound_poll(void) {
  sound_driver_poll();
  sound_sequence_poll();
}

bool sound_busy(void) {
  return sound_sequence != NULL || sound_driver_busy();
}

void delay_with_sound_poll(t_time_ms duration_ms) {
  const t_time_ms stop_at = millis() + duration_ms;
  do {
    sound_poll();
    delay(1);
  } while((i32) (millis() - stop_at) < 0);
  sound_poll();
}

void sound_scaled(usize pin, isize freq_Hz, usize duration_ms, usize volume, usize volume_percent) {
  sound_sequence_cancel();
  sound_driver_play_scaled(pin, freq_Hz, duration_ms, volume, volume_percent);
}

void  sound(usize pin, isize freq_Hz, usize duration_ms, usize volume) {
  sound_scaled(pin, freq_Hz, duration_ms, volume, 100);
}

void  sound_stop(void) {
  sound_sequence_cancel();
  sound_driver_stop();
}

void sound_startup(void) {
  sound_sequence_start(STARTUP_JINGLE, sizeof(STARTUP_JINGLE) / sizeof(STARTUP_JINGLE[0]), PIN_BUZZER);
}

// Паттерн из терминала копируется в свой буфер: строка ввода не переживает
// асинхронное воспроизведение.
static SoundNote user_pattern[SOUND_PATTERN_MAX];

bool sound_pattern_start(const SoundNote* notes, usize count) {
  if(notes == NULL || count == 0 || count > SOUND_PATTERN_MAX) return false;
  for(usize i = 0; i < count; i++) {
    if(!runtime_safety::valid_sound_note(notes[i].frequency_Hz, notes[i].duration_ms,
                                         notes[i].volume_percent)) return false;
  }

  sound_stop();
  for(usize i = 0; i < count; i++) user_pattern[i] = notes[i];
  sound_sequence_start(user_pattern, count, PIN_BUZZER);
  return true;
}

void message_and_waitkey(const char* lcd_message) {
  led::on();
  {
    MK61DisplayUpdate update(main_lcd());
    main_lcd().setCursor(0, 1); main_lcd().print(lcd_message);
  }
  kbd::get_key_wait();
  led::off();
}

// Вставка кода операции в программу mk61s с указанного шага с коррекцией команд,
// содержащих адрес перехода
void  insert_cmd_in_program(usize into_step, usize opcode) {
  u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};

  dbgln(MINI, "Insert comand <", opcode, "> in program step ", into_step);
  
  core_61::get_code_page(&code_page[0]);

  bool  inc_operand = false;
  u8    move_code, copy_code = opcode;

  const usize program_steps = core_61::program_steps();
  for(usize i = into_step; i < program_steps; i++) {
    move_code = code_page[i];

    if(inc_operand) {
      // необходима коррекция операнда предыдущей команды
      if(copy_code >= into_step) copy_code++;
      inc_operand = false;
    } else { // рассматриваемое данное это команда, не операнд!
      if(core_61::len_code_command(copy_code) == 2) { 
      // установить необходимость коррекция второго операнда команды (адреса перехода)
        dbgln(MINI, "Step ", i, " 2 operand opcode: ", copy_code);
        inc_operand = true;
      }
    }
    code_page[i] = copy_code;
    copy_code = move_code;
  }
  core_61::set_code_page(code_page);
}

#if defined(ARDUINO_ARCH_STM32) && !defined(PROGRAM_STORE_HOST_TEST)
static manual_lifetime::Storage<SpiNorFlash> mk61_flash_storage;
SpiNorFlash* external_flash_pointer;

void construct_external_flash(void) {
  external_flash_pointer =
    &mk61_flash_storage.construct(PIN_SPIFLASH_CS, &SPI);
}
#else
SpiNorFlash flash(PIN_SPIFLASH_CS);
SpiNorFlash& external_flash(void) { return flash; }
void construct_external_flash(void) {}
#endif
bool      flash_is_ok;

static constexpr u32 LEGACY_EEPROM_PAGE_SIZE = 8 * 1024;

static u32 settings_flash_address(void) {
  return program_store::settings_address();
}

static u16 settings_flash_size(void) {
  return program_store::settings_size();
}

struct PersistentSettings {
  u8 grade;
  u8 counter;
  u8 flags;
  u8 sound;
#if defined(MK61_OLED1602_WS0010)
  u8 oled;
#endif
#if MK61_PROPORTIONAL_UI_FONTS
  u8 ui_font;
#endif
  lcd_display::TextProfile text_profile;
  bool text_profile_stored;
};

static PersistentSettings persistent_settings = {
  0xFF,
  0,
  0xFF,
  0xFF,
#if defined(MK61_OLED1602_WS0010)
  0xFF,
#endif
#if MK61_PROPORTIONAL_UI_FONTS
  UiFontSettings::DEFAULT_PRESET,
#endif
  lcd_display::defaultSettingsTextProfile(),
  false
};
static bool persistent_settings_loaded = false;
static bool persistent_settings_sector_dirty = false;
static bool persistent_settings_needs_save = false;
static bool persistent_settings_write_blocked = false;
static u32 persistent_settings_next_address;

