bolknote/MK61S_MINI/code/tools.cpp
  persistent_settings_next_address += settings_journal::RECORD_SIZE;
  persistent_settings_needs_save = false;
  return true;
}

AngleUnit read_stored_grade_switch(void) {
  load_persistent_settings();
  return (AngleUnit) persistent_settings.grade;
}

u8 read_counter_switch(void) {
  load_persistent_settings();
  return persistent_settings.counter;
}

SettingsFlags read_settings_flags(void) {
  load_persistent_settings();
  return normalize_settings_flags(persistent_settings.flags);
}

void store_settings_flags(SettingsFlags flags) {
  load_persistent_settings();
  flags = normalize_settings_flags(flags.raw);
  if(persistent_settings.flags != flags.raw) {
    persistent_settings.flags = flags.raw;
    persistent_settings_needs_save = true;
  }

  write_persistent_settings();
}

SoundSettings read_sound_settings(void) {
  load_persistent_settings();
  return normalize_sound_settings(persistent_settings.sound);
}

void store_sound_settings(SoundSettings settings) {
  load_persistent_settings();
  settings = normalize_sound_settings(settings.raw);
  if(persistent_settings.sound != settings.raw) {
    persistent_settings.sound = settings.raw;
    persistent_settings_needs_save = true;
  }

  write_persistent_settings();
}

OledSettings read_oled_settings(void) {
#if defined(MK61_OLED1602_WS0010)
  load_persistent_settings();
  return normalize_oled_settings(persistent_settings.oled);
#else
  return normalize_oled_settings(0xFF);
#endif
}

UiFontSettings read_ui_font_settings(void) {
#if MK61_PROPORTIONAL_UI_FONTS
  load_persistent_settings();
  return normalize_ui_font_settings(persistent_settings.ui_font);
#else
  return UiFontSettings();
#endif
}

void store_oled_settings(OledSettings settings) {
#if defined(MK61_OLED1602_WS0010)
  load_persistent_settings();
  settings = normalize_oled_settings(settings.raw);
  if(persistent_settings.oled != settings.raw) {
    persistent_settings.oled = settings.raw;
    persistent_settings_needs_save = true;
  }
  write_persistent_settings();
#else
  (void) settings;
#endif
}

bool read_display_text_profile(lcd_display::TextProfile& out) {
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  load_persistent_settings();
  if(!persistent_settings.text_profile_stored) return false;

  out = lcd_display::normalizeSettingsTextProfile(persistent_settings.text_profile);
  return true;
#else
  (void) out;
  load_persistent_settings();
  return false;
#endif
}

void store_display_text_profile(lcd_display::TextProfile profile) {
#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  load_persistent_settings();
  profile = lcd_display::normalizeSettingsTextProfile(profile);
  const bool unchanged = persistent_settings.text_profile_stored &&
    persistent_settings.text_profile.rows == profile.rows &&
    persistent_settings.text_profile.glyph_width == profile.glyph_width &&
    persistent_settings.text_profile.glyph_height == profile.glyph_height &&
    persistent_settings.text_profile.line_gap == profile.line_gap;
  if(!unchanged) {
    persistent_settings.text_profile = profile;
    persistent_settings.text_profile_stored = true;
    persistent_settings_needs_save = true;
  }
  write_persistent_settings();
#else
  (void) profile;
#endif
}

bool store_settings_snapshot(
  SettingsFlags flags,
  SoundSettings sound,
  const lcd_display::TextProfile* text_profile,
  const OledSettings* oled_settings,
  const UiFontSettings* ui_font_settings
) {
  load_persistent_settings();
  flags = normalize_settings_flags(flags.raw);
  sound = normalize_sound_settings(sound.raw);

  if(persistent_settings.flags != flags.raw) {
    persistent_settings.flags = flags.raw;
    persistent_settings_needs_save = true;
  }
  if(persistent_settings.sound != sound.raw) {
    persistent_settings.sound = sound.raw;
    persistent_settings_needs_save = true;
  }

#if MK61_ENABLE_EXTENDED_FONT_SETTINGS
  if(text_profile != NULL) {
    const lcd_display::TextProfile profile = lcd_display::normalizeSettingsTextProfile(*text_profile);
    const bool unchanged = persistent_settings.text_profile_stored &&
      persistent_settings.text_profile.rows == profile.rows &&
      persistent_settings.text_profile.glyph_width == profile.glyph_width &&
      persistent_settings.text_profile.glyph_height == profile.glyph_height &&
      persistent_settings.text_profile.line_gap == profile.line_gap;
    if(!unchanged) {
      persistent_settings.text_profile = profile;
      persistent_settings.text_profile_stored = true;
      persistent_settings_needs_save = true;
    }
  }
#else
  (void) text_profile;
#endif

#if defined(MK61_OLED1602_WS0010)
  if(oled_settings != NULL) {
    const OledSettings oled = normalize_oled_settings(oled_settings->raw);
    if(persistent_settings.oled != oled.raw) {
      persistent_settings.oled = oled.raw;
      persistent_settings_needs_save = true;
    }
  }
#else
  (void) oled_settings;
#endif

#if MK61_PROPORTIONAL_UI_FONTS
  if(ui_font_settings != NULL) {
    const u8 raw = normalize_ui_font_settings(ui_font_settings->raw).raw;
    if(persistent_settings.ui_font != raw) {
      persistent_settings.ui_font = raw;
      persistent_settings_needs_save = true;
    }
  }
#else
  (void) ui_font_settings;
#endif

  return write_persistent_settings();
}

void store_grade_switch(AngleUnit angle_unit) {
  load_persistent_settings();
  if(angle_unit != RADIAN && angle_unit != GRADE && angle_unit != DEGREE) return;
  if(persistent_settings.grade == (u8) angle_unit) {
    write_persistent_settings();
    return;
  }

  persistent_settings.grade = (u8) angle_unit;
  persistent_settings.counter++;
  persistent_settings_needs_save = true;
  write_persistent_settings();
}

bool erase_slot_old(usize nSlot) {
  if(nSlot > MAX_SLOT_FOR_PROGRAM) return false;
  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) nSlot);
  return !program_store::exists(program_store::ProgramType::MK61, name) ||
         program_store::remove(program_store::ProgramType::MK61, name);
}

bool erase_slot(usize nSlot) {
  return erase_slot_old(nSlot);
}

usize seek_program_END(u8* code_page) {
  const isize program_steps = (isize) core_61::program_steps();
  isize lastCommand = program_steps;
  while (lastCommand > 0 && code_page[lastCommand] == 0) {
    lastCommand--;
  }

  if(lastCommand == 0 && code_page[0] == 0) return 0;
  if(lastCommand < program_steps) lastCommand++;
  if(lastCommand < program_steps) lastCommand++;

  return lastCommand;
}

isize  calc_address(usize nSlot) {
  if(nSlot > MAX_SLOT_FOR_PROGRAM) return -1;

